sonicFoam/Ударная труба Сода/sod_shock_tube/sod_shock_tube/system/functionObject1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
(

additional_fields_aposteriori
{
    type writeRegisteredObject;
    functionObjectLibs ( "libIOFunctionObjects.so" );
        
    objectNames ("rho");

    enabled           true;
    outputControl     outputTime;
}

);
