sonicFoam/Ударная труба Сода/sod_shock_tube/sod_shock_tube/system/functionObject3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
(

CourantNo_aposteriori
{
    type                CourantNo;
    functionObjectLibs  ("libutilityFunctionObjects.so");
}

);
